jmeter/plans/06-mixed-scenario.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="06 Mixed Scenario" enabled="true">
      <stringProp name="TestPlan.comments">混合场景测试 - 同时有私聊和群聊流量
策略: 70% 私聊 + 30% 群聊, 模拟真实场景
私聊线程组: 只发不收, 关注吞吐
群聊线程组: 只发不收, 关注吞吐
参数:
  私聊: -JpvtThreads=280 -JpvtDelayMs=40
  群聊: -JgrpThreads=120 -JgrpDelayMs=40
  公共: -Jduration=180 -Jramp=30
目标: 280线程x25msg/s + 120线程x25msg/s = 10000 msg/s</stringProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>

      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Private Chat Senders" enabled="true">
        <stringProp name="ThreadGroup.num_threads">${__P(pvtThreads,280)}</stringProp>
        <stringProp name="ThreadGroup.ramp_time">${__P(ramp,30)}</stringProp>
        <boolProp name="ThreadGroup.scheduler">true</boolProp>
        <stringProp name="ThreadGroup.duration">${__P(duration,180)}</stringProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController">
          <stringProp name="LoopController.loops">-1</stringProp>
          <boolProp name="LoopController.continue_forever">true</boolProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>
        <CSVDataSet guiclass="TestBeanGUI" testclass="CSVDataSet" testname="private-pairs.csv" enabled="true">
          <stringProp name="filename">${__P(data.dir,../data)}/private-pairs.csv</stringProp>
          <stringProp name="fileEncoding">UTF-8</stringProp>
          <stringProp name="variableNames">aUsername,aUserId,aToken,bUsername,bUserId,bToken</stringProp>
          <boolProp name="ignoreFirstLine">true</boolProp>
          <stringProp name="delimiter">,</stringProp>
          <boolProp name="quotedData">false</boolProp>
          <boolProp name="recycle">true</boolProp>
          <boolProp name="stopThread">false</boolProp>
          <stringProp name="shareMode">shareMode.all</stringProp>
        </CSVDataSet>
        <hashTree/>

        <eu.luminis.jmeter.wssampler.OpenWebSocketSampler guiclass="eu.luminis.jmeter.wssampler.OpenWebSocketSamplerGui" testclass="eu.luminis.jmeter.wssampler.OpenWebSocketSampler" testname="Pvt WS Connect" enabled="true">
          <stringProp name="server">${__P(host,localhost)}</stringProp>
          <stringProp name="port">${__P(wsport,8081)}</stringProp>
          <stringProp name="path">/ws</stringProp>
          <stringProp name="connectTimeout">15000</stringProp>
          <stringProp name="readTimeout">15000</stringProp>
          <stringProp name="connectionId">mix-pvt-${__threadNum}</stringProp>
        </eu.luminis.jmeter.wssampler.OpenWebSocketSampler>
        <hashTree/>

        <eu.luminis.jmeter.wssampler.SingleWriteWebSocketSampler guiclass="eu.luminis.jmeter.wssampler.SingleWriteWebSocketSamplerGui" testclass="eu.luminis.jmeter.wssampler.SingleWriteWebSocketSampler" testname="Pvt Auth" enabled="true">
          <stringProp name="dataType">Text</stringProp>
          <stringProp name="requestData">{"type":"auth","token":"${aToken}","deviceId":"mixP_${aUserId}"}</stringProp>
          <stringProp name="connectionId">mix-pvt-${__threadNum}</stringProp>
        </eu.luminis.jmeter.wssampler.SingleWriteWebSocketSampler>
        <hashTree/>

        <eu.luminis.jmeter.wssampler.SingleReadWebSocketSampler guiclass="eu.luminis.jmeter.wssampler.SingleReadWebSocketSamplerGui" testclass="eu.luminis.jmeter.wssampler.SingleReadWebSocketSampler" testname="Pvt Auth Resp" enabled="true">
          <stringProp name="dataType">Text</stringProp>
          <stringProp name="readTimeout">5000</stringProp>
          <stringProp name="connectionId">mix-pvt-${__threadNum}</stringProp>
        </eu.luminis.jmeter.wssampler.SingleReadWebSocketSampler>
        <hashTree>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="auth ok" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="-1234">"status":"success"</stringProp>
            </collectionProp>
            <stringProp name="Assertion.test_field">Assertion.response_data</stringProp>
            <intProp name="Assertion.test_type">16</intProp>
          </ResponseAssertion>
          <hashTree/>
        </hashTree>

        <LoopController guiclass="LoopControlPanel" testclass="LoopController" testname="Pvt Send Loop" enabled="true">
          <stringProp name="LoopController.loops">-1</stringProp>
          <boolProp name="LoopController.continue_forever">true</boolProp>
        </LoopController>
        <hashTree>
          <ConstantTimer guiclass="ConstantTimerGui" testclass="ConstantTimer" testname="Pvt delay" enabled="true">
            <stringProp name="ConstantTimer.delay">${__P(pvtDelayMs,40)}</stringProp>
          </ConstantTimer>
          <hashTree/>

          <eu.luminis.jmeter.wssampler.SingleWriteWebSocketSampler guiclass="eu.luminis.jmeter.wssampler.SingleWriteWebSocketSamplerGui" testclass="eu.luminis.jmeter.wssampler.SingleWriteWebSocketSampler" testname="Send Private Msg" enabled="true">
            <stringProp name="dataType">Text</stringProp>
            <stringProp name="requestData">{"type":"message","toUserId":${bUserId},"msgType":1,"content":"mix-pvt u${aUserId}->${bUserId} ${__time(HHmmssSSS)} ${__Random(1,99999)}"}</stringProp>
            <stringProp name="connectionId">mix-pvt-${__threadNum}</stringProp>
          </eu.luminis.jmeter.wssampler.SingleWriteWebSocketSampler>
          <hashTree/>
        </hashTree>

        <eu.luminis.jmeter.wssampler.CloseWebSocketSampler guiclass="eu.luminis.jmeter.wssampler.CloseWebSocketSamplerGui" testclass="eu.luminis.jmeter.wssampler.CloseWebSocketSampler" testname="Pvt WS Close" enabled="true">
          <stringProp name="statusCode">1000</stringProp>
          <stringProp name="readTimeout">3000</stringProp>
          <stringProp name="connectionId">mix-pvt-${__threadNum}</stringProp>
        </eu.luminis.jmeter.wssampler.CloseWebSocketSampler>
        <hashTree/>
      </hashTree>

      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Group Chat Senders" enabled="true">
        <stringProp name="ThreadGroup.num_threads">${__P(grpThreads,120)}</stringProp>
        <stringProp name="ThreadGroup.ramp_time">${__P(ramp,30)}</stringProp>
        <boolProp name="ThreadGroup.scheduler">true</boolProp>
        <stringProp name="ThreadGroup.duration">${__P(duration,180)}</stringProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController">
          <stringProp name="LoopController.loops">-1</stringProp>
          <boolProp name="LoopController.continue_forever">true</boolProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>
        <CSVDataSet guiclass="TestBeanGUI" testclass="CSVDataSet" testname="group-members.csv" enabled="true">
          <stringProp name="filename">${__P(data.dir,../data)}/group-members.csv</stringProp>
          <stringProp name="fileEncoding">UTF-8</stringProp>
          <stringProp name="variableNames">groupId,userId,token</stringProp>
          <boolProp name="ignoreFirstLine">true</boolProp>
          <stringProp name="delimiter">,</stringProp>
          <boolProp name="quotedData">false</boolProp>
          <boolProp name="recycle">true</boolProp>
          <boolProp name="stopThread">false</boolProp>
          <stringProp name="shareMode">shareMode.all</stringProp>
        </CSVDataSet>
        <hashTree/>

        <eu.luminis.jmeter.wssampler.OpenWebSocketSampler guiclass="eu.luminis.jmeter.wssampler.OpenWebSocketSamplerGui" testclass="eu.luminis.jmeter.wssampler.OpenWebSocketSampler" testname="Grp WS Connect" enabled="true">
          <stringProp name="server">${__P(host,localhost)}</stringProp>
          <stringProp name="port">${__P(wsport,8081)}</stringProp>
          <stringProp name="path">/ws</stringProp>
          <stringProp name="connectTimeout">15000</stringProp>
          <stringProp name="readTimeout">15000</stringProp>
          <stringProp name="connectionId">mix-grp-${__threadNum}</stringProp>
        </eu.luminis.jmeter.wssampler.OpenWebSocketSampler>
        <hashTree/>

        <eu.luminis.jmeter.wssampler.SingleWriteWebSocketSampler guiclass="eu.luminis.jmeter.wssampler.SingleWriteWebSocketSamplerGui" testclass="eu.luminis.jmeter.wssampler.SingleWriteWebSocketSampler" testname="Grp Auth" enabled="true">
          <stringProp name="dataType">Text</stringProp>
          <stringProp name="requestData">{"type":"auth","token":"${token}","deviceId":"mixG_${userId}"}</stringProp>
          <stringProp name="connectionId">mix-grp-${__threadNum}</stringProp>
        </eu.luminis.jmeter.wssampler.SingleWriteWebSocketSampler>
        <hashTree/>

        <eu.luminis.jmeter.wssampler.SingleReadWebSocketSampler guiclass="eu.luminis.jmeter.wssampler.SingleReadWebSocketSamplerGui" testclass="eu.luminis.jmeter.wssampler.SingleReadWebSocketSampler" testname="Grp Auth Resp" enabled="true">
          <stringProp name="dataType">Text</stringProp>
          <stringProp name="readTimeout">5000</stringProp>
          <stringProp name="connectionId">mix-grp-${__threadNum}</stringProp>
        </eu.luminis.jmeter.wssampler.SingleReadWebSocketSampler>
        <hashTree>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="auth ok" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="-1234">"status":"success"</stringProp>
            </collectionProp>
            <stringProp name="Assertion.test_field">Assertion.response_data</stringProp>
            <intProp name="Assertion.test_type">16</intProp>
          </ResponseAssertion>
          <hashTree/>
        </hashTree>

        <LoopController guiclass="LoopControlPanel" testclass="LoopController" testname="Grp Send Loop" enabled="true">
          <stringProp name="LoopController.loops">-1</stringProp>
          <boolProp name="LoopController.continue_forever">true</boolProp>
        </LoopController>
        <hashTree>
          <ConstantTimer guiclass="ConstantTimerGui" testclass="ConstantTimer" testname="Grp delay" enabled="true">
            <stringProp name="ConstantTimer.delay">${__P(grpDelayMs,40)}</stringProp>
          </ConstantTimer>
          <hashTree/>

          <eu.luminis.jmeter.wssampler.SingleWriteWebSocketSampler guiclass="eu.luminis.jmeter.wssampler.SingleWriteWebSocketSamplerGui" testclass="eu.luminis.jmeter.wssampler.SingleWriteWebSocketSampler" testname="Send Group Msg" enabled="true">
            <stringProp name="dataType">Text</stringProp>
            <stringProp name="requestData">{"type":"message","groupId":${groupId},"msgType":1,"content":"mix-grp u${userId} ${__time(HHmmssSSS)} ${__Random(1,99999)}"}</stringProp>
            <stringProp name="connectionId">mix-grp-${__threadNum}</stringProp>
          </eu.luminis.jmeter.wssampler.SingleWriteWebSocketSampler>
          <hashTree/>
        </hashTree>

        <eu.luminis.jmeter.wssampler.CloseWebSocketSampler guiclass="eu.luminis.jmeter.wssampler.CloseWebSocketSamplerGui" testclass="eu.luminis.jmeter.wssampler.CloseWebSocketSampler" testname="Grp WS Close" enabled="true">
          <stringProp name="statusCode">1000</stringProp>
          <stringProp name="readTimeout">3000</stringProp>
          <stringProp name="connectionId">mix-grp-${__threadNum}</stringProp>
        </eu.luminis.jmeter.wssampler.CloseWebSocketSampler>
        <hashTree/>
      </hashTree>

      <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>

    </hashTree>
  </hashTree>
</jmeterTestPlan>